TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/examples/dsp/dsp_fpu_fir_filter_fpu32_f28003x.c
#include "fpu.h"
#include "dsp_examples_setup.h"
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"

#define TEST_SIZE       (512U)

float test_input[571] = {
    11.18400787690F,  9.47301312325F,  5.61745167014F,  0.65355955931F,
     3.00552485572F,  0.51964789491F, -0.75096684202F, -3.49179057553F,
    -0.64046466598F, -3.23984530386F, -4.33750751689F, -7.01033599991F,
    -4.23417148315F, -5.63522010659F, -3.12166180175F, -1.12826745742F,
     4.36964107998F,  2.36309819591F,  2.54017646605F,  2.63609229921F,
     6.64521303751F,  2.15186774842F, -0.76680265070F, -1.61399081375F,
     5.18347708186F,  4.53859514204F,  1.82441872726F, -3.65389115198F,
    -1.99999516185F, -2.99686798183F, -0.91865578295F, -1.31974440683F,
     1.19627529145F, -2.69891472316F, -3.36721912053F, -3.92501970168F,
    -0.02171069209F, -2.86264026815F, -2.63430310872F, -1.10386725714F,
     5.72358346928F,  4.23043889691F,  2.63488660926F,  0.50206007657F,
     4.53970300895F,  2.23475805441F,  0.85900953036F, -0.85345087289F,
     4.18930832756F,  3.38562536466F,  1.95892872997F, -3.41699116566F,
    -4.22316326073F, -8.21131512702F, -6.66627038953F, -4.94773499337F,
    -0.22872434896F, -3.49057246234F, -3.64314322492F, -1.57581274323F,
     6.49026674380F,  6.20151956131F,  5.48072393724F,  4.18937386131F,
     9.11259624385F,  6.88842762490F,  3.49308500490F, -2.61427795082F,
    -2.59872680707F, -6.06050889815F, -5.72261232540F, -5.62872533755F,
    -0.47148912335F, -1.39091974374F, -0.77523176084F, -2.25705992648F,
    -0.18760356639F, -4.02369056367F, -3.41245614207F, -1.12519581704F,
     5.53745460267F,  2.87414818080F,  0.41580774973F, -0.91083959098F,
     5.49707798524F,  5.44385951168F,  4.42136964878F,  0.94888239265F,
     3.69104272060F,  1.96266417966F,  1.53336809726F, -2.09404389103F,
    -2.00148731252F, -6.39262909880F, -5.57360365205F, -3.74943151002F,
     1.78622144326F, -1.43775630393F, -3.74377784243F, -5.77147072662F,
    -1.70833334357F, -3.63323900298F, -2.89519793703F, -0.82966527061F,
     7.52813322549F,  8.00453488755F,  7.12982493698F,  4.10584532206F,
     7.30920259691F,  5.42165443863F,  4.19595043474F, -0.17135464773F,
    -0.27062842899F, -4.84268129793F, -5.38012991271F, -6.50527482318F,
    -4.14105092907F, -8.26937167297F, -7.67538757941F, -4.09237212289F,
     4.95580521561F,  4.17379421496F,  1.54194380921F, -1.96249339215F,
     2.03439998671F,  1.31990072752F,  1.86067256217F,  0.84650401717F,
     5.18019311040F,  3.64417497208F,  3.03314435970F,  0.16571759626F,
     2.04473999047F, -0.87976799589F, -0.34869674221F, -0.56522433300F,
     2.75047173858F, -1.17640438709F, -2.48175715485F, -3.33355596947F,
     0.27907588748F, -4.10649398561F, -6.49588032906F, -6.48205503278F,
     1.43197624706F,  2.10330644705F,  0.86151955181F, -3.03695704386F,
     0.23095930120F,  0.77269819693F,  4.17045536911F,  4.71042378976F,
     7.64453163477F,  3.54983096665F,  2.04846214639F,  0.10031840600F,
     2.21765453436F, -2.58451257462F, -4.25374937993F, -4.34319049609F,
     1.29551307366F, -0.88172424815F, -2.66229242942F, -4.54701313780F,
     0.07491600975F, -1.40733548296F, -1.79904398714F, -2.41542559032F,
     3.80579963949F,  4.23442427611F,  4.04576014131F, -0.16777810092F,
    -0.00176223139F, -3.33965354582F, -1.58676815624F, -0.17918095744F,
     3.70505994408F, -0.83657103015F, -2.55853400969F, -2.14454717664F,
     4.40100749373F,  2.91061393158F,  1.42882852906F, -0.14219790935F,
     4.94560574048F,  3.23675817452F,  0.58912909120F, -4.64938078508F,
    -3.72530358807F, -6.28310034949F, -5.06115350183F, -4.10935469027F,
     1.86022920056F,  1.65898945710F,  2.81844876750F,  1.60729263423F,
     3.58302791649F, -0.76451931710F, -1.07249183454F, -0.02752399293F,
     5.22140051645F,  1.16558142774F, -2.46846778047F, -4.59556255619F,
     1.47717702762F,  1.56134490062F,  1.07948050454F, -1.57126533060F,
     2.13271245766F,  1.37993809753F,  1.85228598256F, -0.98880820469F,
    -0.22905657850F, -4.05906972724F, -2.77918468663F, -0.61398835928F,
     5.09298478560F,  1.80120190288F, -0.87728316277F, -3.61520595798F,
    -0.57688132669F, -3.75128180472F, -4.33869755155F, -3.49257134112F,
     3.93023039301F,  3.89230815145F,  2.98881005556F,  0.40298645407F,
     4.41770380409F,  3.57167865350F,  3.46086632603F,  0.14611321619F,
     0.94680723560F, -2.91484043812F, -2.92461121657F, -3.67604662108F,
    -1.06709933492F, -5.07843380690F, -4.52456503664F, -1.18984916693F,
     7.35088423817F,  5.77877825477F,  2.10128498995F, -2.61636350818F,
     0.14110233442F, -1.66894272103F, -1.91662509292F, -3.29268622132F,
     1.15381388778F,  0.17174474613F,  0.45030755684F, -1.34232217083F,
     1.63754742294F, -0.29291295057F,  1.04289206784F,  1.41657389103F,
     5.12935686038F,  1.45104630755F,  0.28617920647F, -0.51852061236F,
     3.02844309511F, -1.58123626533F, -4.40397308706F, -5.06149190488F,
     1.96003139318F,  1.59125650728F, -0.71411168881F, -5.54796375321F,
    -2.94181103543F, -2.68415483038F,  0.84395834284F,  1.88906745509F,
     5.59762952877F,  2.40265092978F,  1.77955599810F,  0.57295985981F,
     3.23389135025F, -1.22464864517F, -2.70577236348F, -2.69720874692F,
     3.00641555032F,  0.88641015778F, -0.86036154085F, -2.78442541953F,
     1.66259237305F, -0.17738142699F, -1.11678187341F, -2.42486044284F,
     3.05582245549F,  2.81885839279F,  2.16057300198F, -2.24127253536F,
    -1.95679353188F, -4.91182073272F, -2.61080602661F, -0.61877276337F,
     3.76234037889F, -0.45642194446F, -2.05812008817F, -1.69469133690F,
     4.70615051236F,  3.07025243771F,  1.52052764966F, -0.00263119820F,
     5.23626970320F,  3.72512269117F,  1.24276249322F, -3.93523910231F,
    -3.09422756159F, -5.86845474225F, -4.93817316981F, -4.26482319177F,
     1.52972155757F,  1.31840583796F,  2.64339272917F,  1.72639594177F,
     4.03181830365F, -0.06322975238F, -0.29460105953F,  0.59679497710F,
     5.46996910720F,  0.88614665545F, -3.31480760105F, -5.92201432128F,
    -0.13879153091F, -0.09872205105F, -0.38538887055F, -2.66238939129F,
     1.50054116356F,  1.19630849593F,  2.03760188847F, -0.53894192383F,
     0.40223816448F, -3.27682017958F, -1.81822771798F,  0.58929220164F,
     6.59534119836F,  3.60432697826F,  1.13699395726F, -1.58075630861F,
     1.20788854453F, -2.51371988147F, -3.90673651199F, -4.02152529708F,
     2.43093629112F,  1.56835224396F,  0.11375290463F, -2.67775343155F,
     1.47945725188F,  1.06364913452F,  1.56941379940F, -1.05344758938F,
     0.42390992580F, -2.82650032662F, -2.29648657461F, -2.55393667218F,
     0.53682469869F, -2.98939637259F, -1.96877607535F,  1.75094420975F,
    10.50208296756F,  8.86940922968F,  4.79225495474F, -0.67650082085F,
     1.03594219218F, -1.99015347314F, -3.45947410600F, -5.88990444917F,
    -2.18795176377F, -3.52223464210F, -3.19468091692F, -4.59608953652F,
    -0.98697668161F, -2.16771878284F, -0.06149312072F,  1.04224568006F,
     5.42732256278F,  2.37838647902F,  1.82425590308F,  1.61990094763F,
     5.73042354049F,  1.58195383351F, -0.97462083771F, -1.65537744887F,
     4.98864396318F,  3.87952316758F,  0.53207655516F, -5.51992401874F,
    -4.14102578031F, -4.94682260977F, -2.17720611497F, -1.50570384568F,
     2.21973116494F, -0.63022358051F, -0.68707714325F, -1.22517109228F,
     2.10723801383F, -1.73513711688F, -2.66759652279F, -2.15552587924F,
     4.04007519810F,  2.41924023098F,  1.16311851160F, -0.33455861795F,
     4.38975190852F,  2.58852658912F,  1.38558238918F, -0.50011292923F,
     4.14230820363F,  2.92017718962F,  1.28128211773F, -3.94174566535F,
    -4.19708355724F, -7.34946212381F, -4.91455180815F, -2.53291392949F,
     2.37833212674F, -1.29099477237F, -2.41897002979F, -1.70497689161F,
     4.92797086098F,  3.44993015789F,  2.04274623208F,  0.69237544476F,
     6.14485286154F,  4.85583533169F,  2.53806001111F, -2.61010428080F,
    -1.93323149078F, -5.08121331262F, -4.69309713172F, -4.63646918461F,
     0.59206074289F, -0.01029758457F,  1.18786568095F,  0.43714149237F,
     3.16154253314F, -0.36107890651F,  0.00199029685F,  1.38128527087F,
     6.54316277893F,  2.01345483988F, -2.34230933909F, -5.24067495816F,
     0.20760812668F, -0.04915874790F, -0.54785092499F, -2.95115197701F,
     1.13258217684F,  0.73862892198F,  1.43050265600F, -1.37113800982F,
    -0.70030286748F, -4.62152487526F, -3.28015878330F, -0.77503406313F,
     5.59516069893F,  3.22596623334F,  1.56276642095F, -0.29722957555F,
     3.24977815979F,  0.04655237712F, -1.16228197833F, -1.45349939956F,
     4.50635514510F,  2.93457016742F,  0.67979750642F, -2.88454055364F,
     0.61077442210F, -0.32066840343F, -0.19366965854F, -3.09427379102F,
    -1.83011263778F, -5.24242456478F, -4.79990474098F, -5.01362823098F,
    -1.67559674175F, -4.69126473888F, -2.87844868967F,  1.87243999834F,
    11.78683377237F, 11.29405477593F,  8.16049343947F,  3.28678929969F,
     5.14889240220F,  1.80702815361F, -0.38444002483F, -3.82237523654F,
    -1.26136099867F, -3.72284453765F, -4.39620948707F, -6.61029151911F,
    -3.61281493274F, -5.22397749474F, -3.39470255677F, -2.42673837509F,
     1.98023843677F, -0.84565349827F, -0.92194611418F, -0.35611769243F,
     4.81165447728F,  1.94186338338F,  0.75820838738F,  1.37321942077F,
     9.05256955640F,  8.56205462959F,  5.32200382652F, -1.14555857555F,
    -0.63292340995F, -2.61797095517F, -1.17020376394F, -1.79756602594F,
     0.00035997667F, -0.00043409123F, -0.00094163322F, -0.00166296330F,
    -0.00240169088F, -0.00289512541F, -0.00284979224F, -0.00201845302F,
    -0.00029515241F,  0.00219932183F,  0.00507089183F,  0.00767233563F,
     0.00920431308F,  0.00888736992F,  0.00618106270F,  0.00099882774F,
    -0.00613579574F, -0.01404379173F, -0.02099018660F, -0.02493349802F,
    -0.02389227045F, -0.01636331731F, -0.00170618487F,  0.01959592189F,
     0.04586395632F,  0.07438605111F,  0.10178219837F,  0.12453946353F,
     0.13959399888F,  0.14485885616F,  0.13959399888F,  0.12453946353F,
     0.10178219837F,  0.07438605111F,  0.04586395632F,  0.01959592189F,
    -0.00170618487F, -0.01636331731F, -0.02389227045F, -0.02493349802F,
    -0.02099018660F, -0.01404379173F, -0.00613579574F,  0.00099882774F,
     0.00618106270F,  0.00888736992F,  0.00920431308F,  0.00767233563F,
     0.00507089183F,  0.00219932183F, -0.00029515241F, -0.00201845302F,
    -0.00284979224F, -0.00289512541F, -0.00240169088F, -0.00166296330F,
    -0.00094163322F, -0.00043409123F,  0.00035997667F, };
const float test_golden[512] = {
     0.00402598192F, -0.00144481604F, -0.01262123375F, -0.02972191886F,
    -0.04710516766F, -0.06620499481F, -0.07720189497F, -0.07382175907F,
    -0.04641268422F,  0.00229934146F,  0.07255872742F,  0.15249384875F,
     0.22838662769F,  0.27418459076F,  0.27228131149F,  0.20395402994F,
     0.06546027185F, -0.13823304942F, -0.37352707379F, -0.59530250533F,
    -0.74304025165F, -0.76046621636F, -0.58823919831F, -0.19230983252F,
     0.43221287360F,  1.24187385081F,  2.16417278150F,  3.09117467311F,
     3.90114531045F,  4.46222868199F,  4.66946501012F,  4.45011577448F,
     3.78857617343F,  2.72092554361F,  1.34915184636F, -0.18562350769F,
    -1.71195899483F, -3.06222926996F, -4.07898761824F, -4.65211901021F,
    -4.72514874820F, -4.31246605544F, -3.47687125583F, -2.33271152757F,
    -1.02010491927F,  0.30343508430F,  1.50216774225F,  2.46460655120F,
     3.12219228114F,  3.43939660015F,  3.42897025924F,  3.13109494957F,
     2.61264179854F,  1.94222636304F,  1.19556143318F,  0.43251205694F,
    -0.29633984915F, -0.96085836719F, -1.52493299311F, -1.98311986735F,
    -2.31509997074F, -2.51508869295F, -2.56338980253F, -2.45570058754F,
    -2.17883590524F, -1.73977668938F, -1.14145171092F, -0.41330312418F,
     0.41280913728F,  1.27497314724F,  2.10979597107F,  2.82950410310F,
     3.35585408674F,  3.60286108609F,  3.51513534133F,  3.05285243580F,
     2.22927098439F,  1.09003288338F, -0.26019936464F, -1.69146610646F,
    -3.03398232324F, -4.12351490968F, -4.79844056996F, -4.95211390576F,
    -4.52648676956F, -3.55074466263F, -2.11611968512F, -0.39394925917F,
     1.41160219453F,  3.06652645353F,  4.36802893524F,  5.14913675264F,
     5.32884297522F,  4.89591388258F,  3.93273590248F,  2.57319007441F,
     1.00586787089F, -0.58150003648F, -2.00408314290F, -3.13030603771F,
    -3.86808626616F, -4.19438478901F, -4.12275587208F, -3.71865405304F,
    -3.05636773414F, -2.22915810660F, -1.30972218364F, -0.37102461228F,
     0.54157190816F,  1.38113939192F,  2.12204616355F,  2.72853124536F,
     3.17876578417F,  3.43783082526F,  3.48742333516F,  3.30377941581F,
     2.88990395046F,  2.25181019462F,  1.42547560264F,  0.44839171133F,
    -0.61457291790F, -1.69950725911F, -2.72002374182F, -3.59949028624F,
    -4.24931586915F, -4.60115584136F, -4.58714099877F, -4.17630466015F,
    -3.35724850274F, -2.17241991095F, -0.69478581282F,  0.94669499134F,
     2.60209271673F,  4.08853773549F,  5.23785352170F,  5.89379458741F,
     5.96301565513F,  5.40675695999F,  4.27661022076F,  2.68514470937F,
     0.81962067919F, -1.10849159144F, -2.86814208735F, -4.26900864458F,
    -5.16179697322F, -5.48168854162F, -5.22659687596F, -4.47853055956F,
    -3.36075018570F, -2.04097714810F, -0.67787660585F,  0.57604584234F,
     1.61902107132F,  2.38196424145F,  2.85523263565F,  3.05422714872F,
     3.03419986342F,  2.84846614938F,  2.56033795561F,  2.20498339869F,
     1.81206190217F,  1.38071052689F,  0.91193320593F,  0.38915227402F,
    -0.18575250189F, -0.81090622917F, -1.45297198948F, -2.07475895718F,
    -2.61262223950F, -3.01001226092F, -3.19920270145F, -3.13847593971F,
    -2.79521624569F, -2.18064075143F, -1.32658134800F, -0.31068971673F,
     0.77773393590F,  1.82158253559F,  2.71532683695F,  3.35176354970F,
     3.66317608572F,  3.60588385197F,  3.19242383307F,  2.46329833400F,
     1.50828623343F,  0.43051138676F, -0.63952913133F, -1.58695762839F,
    -2.30170734935F, -2.71883679686F, -2.80070703061F, -2.56770954705F,
    -2.06872577814F, -1.39923515635F, -0.66059103130F,  0.03000472031F,
     0.58408706436F,  0.92967263980F,  1.04715879475F,  0.94518586265F,
     0.68459291806F,  0.34177232391F,  0.01901824806F, -0.20246054486F,
    -0.25348689983F, -0.11611273462F,  0.19755157517F,  0.62000550842F,
     1.06576485730F,  1.42293173742F,  1.60260380218F,  1.53294211138F,
     1.20104017013F,  0.63151094677F, -0.09150535281F, -0.86505815145F,
    -1.56001074248F, -2.07040731518F, -2.30801890906F, -2.24459256343F,
    -1.88990907380F, -1.31348881642F, -0.60497632145F,  0.11668342962F,
     0.75098878507F,  1.20848887699F,  1.45066904085F,  1.46673318502F,
     1.29628120260F,  0.99243757932F,  0.63518843194F,  0.28963808033F,
     0.02017344861F, -0.14483754709F, -0.18903268106F, -0.13266190363F,
     0.00038016477F,  0.16245522878F,  0.31504311591F,  0.40759630261F,
     0.41126709835F,  0.29829766237F,  0.07254152067F, -0.25662835288F,
    -0.64760641701F, -1.05507122493F, -1.40804697626F, -1.64595137624F,
    -1.70294187163F, -1.54610514924F, -1.15822775506F, -0.57119091716F,
     0.15999883108F,  0.93603342230F,  1.65267940363F,  2.19175529600F,
     2.46862436432F,  2.42356918468F,  2.06032566514F,  1.42204052579F,
     0.61206381212F, -0.24864176472F, -1.01830586606F, -1.58757854422F,
    -1.87392193159F, -1.86051322207F, -1.57136078737F, -1.09092684774F,
    -0.52097682337F,  0.01498648324F,  0.42235087503F,  0.62787529777F,
     0.61801202380F,  0.41332967119F,  0.08712448229F, -0.27686805625F,
    -0.57632416359F, -0.73665750978F, -0.70088126218F, -0.46658028642F,
    -0.05937099925F,  0.44810496975F,  0.97582622992F,  1.42448501874F,
     1.71851355390F,  1.79345665712F,  1.63181731029F,  1.23832785895F,
     0.66405147336F, -0.02687830245F, -0.73979798159F, -1.38860056788F,
    -1.88187719064F, -2.16189090900F, -2.18672206667F, -1.96167262429F,
    -1.51160122388F, -0.90316763752F, -0.21030851831F,  0.46959355564F,
     1.05636046081F,  1.47355530573F,  1.68483337647F,  1.67137977667F,
     1.45956693328F,  1.09114341901F,  0.64243346008F,  0.18512417165F,
    -0.20066058296F, -0.46577628193F, -0.57439996204F, -0.53566193896F,
    -0.37551736920F, -0.15669215600F,  0.05973070563F,  0.20145919007F,
     0.22610335190F,  0.10498165607F, -0.14504179584F, -0.48936069315F,
    -0.85434489149F, -1.16514464469F, -1.33468258553F, -1.30818499483F,
    -1.05024628997F, -0.57937120187F,  0.05783362710F,  0.76519779239F,
     1.43695205230F,  1.95031650485F,  2.21449372040F,  2.16325898879F,
     1.79479696284F,  1.14818831626F,  0.32358817931F, -0.55992227173F,
    -1.35806456070F, -1.95169250258F, -2.24233935498F, -2.19557223030F,
    -1.82014769879F, -1.19053043795F, -0.40744422034F,  0.39374873986F,
     1.09269254052F,  1.57952408572F,  1.79820778533F,  1.72671819684F,
     1.40237806924F,  0.88631711339F,  0.27647090629F, -0.33616335477F,
    -0.85667581167F, -1.22556525569F, -1.39874136909F, -1.37549853903F,
    -1.16783031468F, -0.82156695198F, -0.38341719870F,  0.07882940185F,
     0.51147955482F,  0.85601506698F,  1.08142561936F,  1.16009332876F,
     1.09678675565F,  0.90285497760F,  0.62130177665F,  0.29408439953F,
    -0.01910744893F, -0.27671621797F, -0.43715257152F, -0.49308514766F,
    -0.44834419025F, -0.34373273059F, -0.22348321506F, -0.15050483848F,
    -0.16462768298F, -0.29570774619F, -0.52780576603F, -0.82400329123F,
    -1.10459592377F, -1.28726556558F, -1.28054131800F, -1.03319386711F,
    -0.52460422125F,  0.20040556945F,  1.06055043327F,  1.92256418669F,
     2.64836384404F,  3.09427468014F,  3.16453106764F,  2.80531259633F,
     2.04280448714F,  0.95522461872F, -0.31310124054F, -1.60033792089F,
    -2.72636835436F, -3.54663171556F, -3.94865840130F, -3.89404694142F,
    -3.39473175473F, -2.53243620401F, -1.41734658769F, -0.19666816163F,
     0.99283732305F,  2.01719476338F,  2.78615371605F,  3.23343500693F,
     3.34558652751F,  3.13319700477F,  2.65243319033F,  1.96938850957F,
     1.17634915391F,  0.35374056404F, -0.41299897075F, -1.06792991584F,
    -1.56209813351F, -1.88253511831F, -2.02533352681F, -2.01930382796F,
    -1.89172817468F, -1.68634907685F, -1.42919544781F, -1.15090001809F,
    -0.85667261735F, -0.55217812606F, -0.21950585694F,  0.14873188018F,
     0.56742023359F,  1.02405803618F,  1.50045447077F,  1.94463991109F,
     2.30200704155F,  2.49770412004F,  2.47644153789F,  2.18973732926F,
     1.63551486659F,  0.83863567400F, -0.12217081499F, -1.14820506256F,
    -2.10606970384F, -2.87160241987F, -3.32370509497F, -3.39175561153F,
    -3.04327107832F, -2.31683950188F, -1.29292343441F, -0.11082613198F,
     1.07613690055F,  2.09781269081F,  2.82008120976F,  3.14043369568F,
     3.02994023338F,  2.51115474784F,  1.67913757805F,  0.65961564771F,
    -0.38506897891F, -1.30743563139F, -1.97257753397F, -2.30477446144F,
    -2.27085286137F, -1.90744534142F, -1.28618445342F, -0.52588449108F,
     0.25482630593F,  0.93270077662F,  1.42501417762F,  1.67337698250F,
     1.67392046310F,  1.44701926829F,  1.05515387862F,  0.56297046008F,
     0.05049419347F, -0.42534005963F, -0.81115192495F, -1.08651622872F,
    -1.23530297405F, -1.26916753535F, -1.19714949240F, -1.04864358617F,
    -0.84125976260F, -0.60304727401F, -0.34357421682F, -0.08121328695F,
     0.18343553921F,  0.44064124127F,  0.69730503102F,  0.94695582178F,
     1.19310434493F,  1.41933311312F,  1.61399991621F,  1.74213481723F,
     1.77348026463F,  1.65971685362F,  1.36881929554F,  0.86845759799F,
     0.16461568443F, -0.71586784156F, -1.69444388872F, -2.67073486964F,
    -3.50555273319F, -4.06548134374F, -4.22026195255F, -3.89555953424F,
    -3.06599798502F, -1.79167137177F, -0.18948054336F,  1.55278441173F,
     3.22704801279F,  4.60960888792F,  5.52171520656F,  5.83161410036F,
};
float coeffs[myFIR0_FIR_ORDER+1];
float delayLine[myFIR0_FIR_ORDER+1];
float test_output[TEST_SIZE];
uint16_t pass = 0U, fail = 0U;
float32_t *filPtr = coeffs;
float32_t *delPtr = delayLine;
float tolerance = 1.0e-6;

void main(void)
{
    //
    // CPU initialization
    //
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    //
    // Variable initialization
    //
    uint16_t i;
    float32u_t in, out, gold, err;
    memcpy(&coeffs, &test_input[TEST_SIZE], (myFIR0_FIR_ORDER + 1U)*sizeof(float));

    //
    // Run and verify reults
    //
    for(i = 0U; i < TEST_SIZE; i++)
    {
        in.f32   = test_input[i];
        out.f32  = FLT_MAX;
        FIR_f32_setInput(myFIR0_handle, in.f32);
        FIR_f32_setOutput(myFIR0_handle, out.f32);

        //
        // Run filter calculation
        //
        myFIR0_handle->calc(myFIR0_handle);

        out.f32 = FIR_f32_getOutput(myFIR0_handle);
        test_output[i] = out.f32;
        gold.f32 = test_golden[i];
        err.f32 = fabsf(out.f32 - gold.f32);

        if(err.f32 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }

    while(1);
}
